{
    "version": "https://jsonfeed.org/version/1",
    "title": "Spaghetti Out The Window",
    "description": "",
    "home_page_url": "https://mrfreshy.github.io/mrfreshy.github.io",
    "feed_url": "https://mrfreshy.github.io/mrfreshy.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "MrFreshy"
    },
    "items": [
        {
            "id": "https://mrfreshy.github.io/mrfreshy.github.io/cars.html",
            "url": "https://mrfreshy.github.io/mrfreshy.github.io/cars.html",
            "title": "Cars",
            "summary": "I have one car available to me, and that car has been out of service since July 12th of this year. I have had only minor issues with my car since I purchased it several years ago, and that has made me quite happy for&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://mrfreshy.github.io/mrfreshy.github.io/media/posts/5/IMG_0104.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://mrfreshy.github.io/mrfreshy.github.io/media/posts/5/responsive/IMG_0104-xs.jpg 300w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/5/responsive/IMG_0104-sm.jpg 480w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/5/responsive/IMG_0104-md.jpg 768w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/5/responsive/IMG_0104-lg.jpg 1024w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/5/responsive/IMG_0104-xl.jpg 1360w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/5/responsive/IMG_0104-2xl.jpg 1600w\"  alt=\"\" width=\"672\" height=\"504\"></figure>\n<p>I have one car available to me, and that car has been out of service since July 12th of this year. I have had only minor issues with my car since I purchased it several years ago, and that has made me quite happy for quite some time. </p>\n<p>I am not an auto mechanic. I work with computers and gadgets. I am somewhat clumsy with fiddly things, and tend to end up breaking things while fixing them. I have managed to work through some projects from time to time using YouTube videos and various forum posts around the Internet to assist me in doing things that I don't normally need to do. Fixing plumbing in a house, or doing minor electrical work generally don't cause me much stress. Any time I need to do something to fix my car, it makes me super anxious. I really don't know what I am doing, and if I cause more damage, then me trying to fix it myself to save money becomes a massive failboat leading to me needing to spend money that I don't have.</p>\n<p>About a year or so ago, I started having some issues with the car misfiring. The issue started as a barely noticeable little hiccup in power, most noticeable when just cruising at speed. Nothing major, just a blip here and there. That blip got worse and worse until it really started being troublesome. Doing a bit of research lead me to replacing the coil packs (they sit on the spark plugs, and make them spark). I couldn't afford to have a mechanic replace the parts, and the parts that I found that were original equipment were really expensive. At the time that it happened, I really needed a car, so I ordered some cheap replacements, watched some videos about it, and got them replaced. That was actually super easy, and made me feel good when that did fix the issue.</p>\n<p>Around the start of the lovely year of fail (2020), I started having issues again with misfiring. I replaced the coil packs with cheap ones again because I had to have my car to do what I was doing for income, and was really broke. Again, it worked, and I was happy. Around the beginning of July, it started again :(</p>\n<p>I ordered one original equipment coil pack since my trouble code reader showed just one cylinder out of four was having issues. I knew I should replace them all, but I was going to do one per week or so as I could afford them. Before I ordered the part, my poor car started acting way worse. It was misfiring, but hardcore, and nearly stalled out on my way home from a store. </p>\n<p>I did some research, and found that there were a few possible reasons for the issue I was having. I like to go from cheap to expensive in my repairs if possible, so I got some spark plugs, and a coil pack. I don't have many tools for doing manly things, so I had to order a spark plug socket. After replacing the plugs, it was still not working properly. With shipping, and diagnosing things, it took a couple of weeks to get all of that done. There were a couple more things that could be causing the issue, and I decided to go for the more expensive of the options, but the one that should theoretically cause me to take less of my engine apart since the thought of doing that at all terrifies me.</p>\n<p>I decided that I was going to replace the fuel injectors. The video on YouTube of someone with my exact year and model of car made it look difficult, but doable. The injectors I could get refurbished for a third of the price of new, so I had to go for that option. I ordered the parts, and waited for a decent enough day where it wasn't going to cook me in 100 degree F heat and high humidity. </p>\n<p>I was able to get almost everything taken apart that I needed to. Almost everything. In this case, almost isn't nearly good enough. There was a single bolt holding the intake manifold onto the engine that I just could not see to get a socket onto. I tried contorting in many different ways, I tried a flashlight to help see, but I couldn't get to it. I thought maybe my tools weren't quite able to reach, so I bought a socket accessory kit. I took my new accessory kit, and an old action camera on a stick out to see if I could get the bolt off. NOPE.JPG</p>\n<p>I called the mechanic that I have used before to see what it could cost to have the injectors replaced because I just couldn't get to them even though you can see them without taking anything off of the engine to begin with. They said that they would not use my parts, and that they could only get new ones. I can't afford that at all. I was going to have to have my car towed in and have them replace one of the four injectors, which I didn't want to do at all. It made no sense to replace one if you had to take most of the engine apart to get there. </p>\n<p>There we were at almost the end of July. I hadn't had a working car in weeks, and had been relying on Instacart (which I delivered for for years) and Shipt to get me groceries and cat supplies. I was resigned to having my car in the shop as soon as I could figure out how I was going to pay for it. I decided to try one more thing before I did that.</p>\n<p>I ordered a <a href=\"https://www.amazon.com/dp/B086X5N5S9/ref=cm_sw_em_r_mt_dp_EL1kFb3M1QRBZ\" target=\"_blank\" rel=\"noopener noreferrer\">borescope </a>from Amazon that comes with a screen that would hopefully let me see where the bolt was so that I could get to it. Today was the day that I decided to do the thing that I need to do, and the borescope was exactly what I needed. I was so excited when I was able to get everything taken off that I needed to, and was presented with a direct view of the fuel rail and injectors, which is what the photo is at the top of the post. Putting the new injectors in was a piece of cake at that point. Getting the car back together again was insanely not cake like at all, and ruined my body for the rest of the day (I am so sore everywhere). </p>\n<p>Finally! I could hopefully drive to Costco today, or another place that I haven't been to in a few weeks... Insert key, turn, NOTHING HAPPENED. I had a diagnostic tool attached to the car since the trouble started, and that killed the battery dead. But I have a portable jump starter! You only get one try to get the car running with this jump starter before you have to disconnect it and reconnect to try again if needed. It was needed. Several times. Opps, I found a vacuum line that wasn't attached, and I attached it. I tried to start it again, and it did start!</p>\n<p>It was running just as horribly as when I parked it a month ago. </p>\n<p>I remembered that I had the one new coil pack that I hadn't installed yet, and figured that I may as well replace it because I had it, and I wanted to have good parts on there if I could. I popped the new pack on, and the car wouldn't start. The battery hadn't had enough time to really charge up when I had started the car earlier. I came in, grabbed the jumpstarter, and got one attempt from it before it died. </p>\n<p>I charged it all day, and went out this evening to try again. The damn jumpstarter is just erroring whenever I connect it to the car now, and is useless. Since I have had it for a while, I figured I would order a new one because I need to try something before throwing in the towel and taking it to the mechanic.</p>\n<p>Hopefully a bit of a boost will get it up and running again. There is one more service that is on the list of possible fixes, and I don't want to do it at all as it requires taking even more of the engine apart and futzing with the internals. </p>\n<p>While I love learning new things and acquiring new skills, I really don't enjoy working on my car. Being able to just take your car into the shop when something happens to it is a foreign concept to me, and I am glad that I have been this fortunate for this long with what I own.</p>",
            "author": {
                "name": "MrFreshy"
            },
            "tags": [
            ],
            "date_published": "2020-08-05T21:53:48-04:00",
            "date_modified": "2020-08-05T21:53:48-04:00"
        },
        {
            "id": "https://mrfreshy.github.io/mrfreshy.github.io/google-it.html",
            "url": "https://mrfreshy.github.io/mrfreshy.github.io/google-it.html",
            "title": "Google it!",
            "summary": "There are communities online surrounding pretty much any subject that you can think of. These places can be a wonderful place for like-minded people to gather to share information about a particular subject. These places (various subreddits, hashtags on Twitter, even facebook groups) sometimes enable&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://cdn.pixabay.com/photo/2016/10/20/08/39/keyboard-1754906_960_720.jpg\" data-is-external-image=\"true\"  alt=\"\" width=\"902\" height=\"600\"></figure>\n<p>There are communities online surrounding pretty much any subject that you can think of. These places can be a wonderful place for like-minded people to gather to share information about a particular subject. These places (various subreddits, hashtags on Twitter, even facebook groups) sometimes enable a fringe interest to survive or even thrive.</p>\n<p>Unfortunately in a lot of cases there is a barrier to entry to the community that you are wanting access to. \"Gatekeeping\" is something that is mentioned frequently, and it can take different forms. In the tech areas, one of the most popular forms of gatekeeping is to tell someone to \"Google it\". When a new person wants to become part of a community, or at least wants to feel it out to see if it fits them, being told to find their own answers can be very off-putting and may lead them to abandon their interest. </p>\n<p>In a lot of cases, especially in more advanced or esoteric subjects, telling someone to find their own answers can be nearly insurmountable due to one thing that most subjects have that creates a barrier to entry whether intentional or not - jargon. Someone with great Google skills will still fail if they have no idea what they are searching for. A lot of times a newbie needs a push toward what to search for. I don't like to find the information for someone if I can help it, but I like to nudge them in the right direction so that they can help themselves in the future. </p>\n<p>A lot of times, people are gatekeepers without really realizing it because they forget that people that are new to their domain really don't know anything about it. Some communities gatekeep more than others, and I don't know if it is more intentional in some subjects than others, but it feels like DIY car and home communities are more inviting to new people than tech-focused ones are. </p>\n<p>Everybody was new sometime. Some questions can be annoying after answering them for the eleventybillionth time, but if you love what you are interested in, and you want that interest to thrive and survive long-term, help the noobs learn how to help themselves. Create a FAQ for your community if you can and point people to that to help push people toward helping themselves. Take a look at what you are doing and how you are providing things every now and again to see if anything changed or needs to be changed. Don't assume that you are working with a dummy just because they don't know what a common term is because it isn't common until it is.</p>",
            "author": {
                "name": "MrFreshy"
            },
            "tags": [
            ],
            "date_published": "2020-08-05T21:53:48-04:00",
            "date_modified": "2020-08-05T21:53:48-04:00"
        },
        {
            "id": "https://mrfreshy.github.io/mrfreshy.github.io/making-websites-was-never-my-forte-2.html",
            "url": "https://mrfreshy.github.io/mrfreshy.github.io/making-websites-was-never-my-forte-2.html",
            "title": "Making websites was never my forte",
            "summary": "I have been involved with tech pretty deeply over multiple decades, and have at times wanted to have a place to post up my thoughts about random topics. For some reason, making websites has never made lot of sense to me. I have never wanted&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://mrfreshy.github.io/mrfreshy.github.io/media/posts/3/coketurkey.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://mrfreshy.github.io/mrfreshy.github.io/media/posts/3/responsive/coketurkey-xs.jpg 300w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/3/responsive/coketurkey-sm.jpg 480w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/3/responsive/coketurkey-md.jpg 768w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/3/responsive/coketurkey-lg.jpg 1024w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/3/responsive/coketurkey-xl.jpg 1360w ,https://mrfreshy.github.io/mrfreshy.github.io/media/posts/3/responsive/coketurkey-2xl.jpg 1600w\"  alt=\"\"></figure>\n<p>I have been involved with tech pretty deeply over multiple decades, and have at times wanted to have a place to post up my thoughts about random topics. For some reason, making websites has never made lot of sense to me. I have never wanted to take the time to learn how to code a site. </p>\n<p>There have been multiple attempts at using this tool or that tool, but even this far into the timeline of websites being a thing, it still isn't EASY. WYSIWYG editing is supposed to make it simple to make what you look at as you design into a presentable website. Every attempt I have made over the years has ended up an exercise in frustration and an abandoned project.</p>\n<p>Getting text posted up seems easy enough, but adding a photo can be maddening. I don't get it, and don't actually want to get it. There are not many topics that I actively just don't want to know, but this is one of them. </p>\n<p>All of that being blah'd, here I am again with an attempt at making something happen. I am using a tool that seems to be okay, but we shall see once I attempt to add an image here and then publish.</p>",
            "author": {
                "name": "MrFreshy"
            },
            "tags": [
            ],
            "date_published": "2020-08-05T21:53:48-04:00",
            "date_modified": "2020-08-05T21:53:48-04:00"
        }
    ]
}
